In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'A':[10, 20, np.nan],
    'B':[40, np.nan, np.nan],
    'C':[70, np.nan, 90]
})

In [3]:
df

      A     B     C
0  10.0  40.0  70.0
1  20.0   NaN   NaN
2   NaN   NaN  90.0

In [4]:
df.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [5]:
df.dropna(axis = 0)

      A     B     C
0  10.0  40.0  70.0

In [6]:
df.dropna(thresh = 2)

      A     B     C
0  10.0  40.0  70.0

In [9]:
df.fillna(value = '----')

      A     B     C
0  10.0  40.0  70.0
1  20.0  ----  ----
2  ----  ----  90.0

In [10]:
df['A'].fillna(value = df['A'].mean())

0    10.0
1    20.0
2    15.0
Name: A, dtype: float64